# IFCParameter Template Find Property Mapping Info(Property Setup Type, String, Element Id) Method

Source: https://www.revitapidocs.com/2026/1f3d6de5-7af8-6f09-99b5-2eff538073ac.htm

---

| IFCParameter Template Find Property Mapping Info(Property Setup Type, String, Element Id) Method |
| --- |

Finds the property mapping info in the property set by id.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public IFCPropertyMappingInfo FindPropertyMappingInfo(
	PropertySetupType propertySetupType,
	string propertySetName,
	ElementId revitPropertyId
)
```

```
Public Function FindPropertyMappingInfo (
	propertySetupType As PropertySetupType,
	propertySetName As String,
	revitPropertyId As ElementId
) As IFCPropertyMappingInfo
```

```
public:
IFCPropertyMappingInfo^ FindPropertyMappingInfo(
	PropertySetupType propertySetupType,
	String^ propertySetName,
	ElementId^ revitPropertyId
)
```

```
member FindPropertyMappingInfo :
        propertySetupType : PropertySetupType *
        propertySetName : string *
        revitPropertyId : ElementId -> IFCPropertyMappingInfo
```

#### Parameters

propertySetupType PropertySetupType
:   The property setup type.

propertySetName String
:   The property set name.

revitPropertyId ElementId
:   The Revit property id.

#### Return Value

IFCPropertyMappingInfo
The property mapping info or if not found. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

See Also

#### Reference

IFCParameterTemplate Class FindPropertyMappingInfo Overload Autodesk.Revit.DB Namespace